# DisableLevelOfDetail Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOrShellTessellationControls..::..DisableLevelOfDetail Method
SolidOrShellTessellationControls Class See Also
---
Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void DisableLevelOfDetail()
```

Visual Basic
---
```text
Public Sub DisableLevelOfDetail
```

Visual C++
---
```text
public:
void DisableLevelOfDetail()
```

# See Also
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace